IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_TX2_CONTROLSS_FSI1_TX2.xml
	<register id="CONTROLSS_FSI1_TX2_TX_OPER_CTRL_HI_ALT1_" acronym="CONTROLSS_FSI1_TX2_TX_OPER_CTRL_HI_ALT1_" offset="0xA" width="16" description="">
		<bitfield id="EXT_TRIG_SEL" width="6" begin="12" end="7" resetval="0x0" description="External Trigger Select bit These bits define which of the 64 external inputs will be used as the source for the external input trigger.  00h (R/W) = Trigger 1 is the source. 01h (R/W) = Trigger 2 is the source. 02h (R/W) = Trigger 3 is the source. ... 3Fh (R/W) = Trigger 64 is the source." range="12 - 7" rwaccess="RW"/> 
		<bitfield id="ECC_SEL" width="1" begin="6" end="6" resetval="0x0" description="ECC Data Width Select bit This bit selects between 16-bit and 32-bit ECC computation.   0h (R/W) = 32-bit ECC is used. 1h (R/W) = 16-bit ECC is used." range="6" rwaccess="RW"/> 
		<bitfield id="FORCE_ERR" width="1" begin="5" end="5" resetval="0x0" description="Error Frame Force bit This bit will force the the CRC value of the transmitted data frame to 0 whenever there is a buffer overrun or underrun condition. This can be used to force a corrupted CRC as the data is not guaranteed to be reliable. The receiver will treat the data as invalid and can handle this as needed. Note: DO NOT use FORCE_ERR if using the SW CRC mode (FSI Transmit).  0h (R/W) = The CRC will not be forced to 0. 1h (R/W) = The CRC will be forced to 0 in a buffer overrun or underrun condition." range="5" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_TX2_TX_FRAME_CTRL" acronym="CONTROLSS_FSI1_TX2_TX_FRAME_CTRL" offset="0xC" width="16" description="">
		<bitfield id="START" width="1" begin="15" end="15" resetval="0x0" description="Start Transmission bit This bit will cause the FSI to start transmitting the next frame.  0h (R/W) = Writing a 0 to this bit will have no effect. 1h (R/W) = Start the next transmission. This bit will be cleared by hardware." range="15" rwaccess="RW"/> 
		<bitfield id="N_WORDS" width="4" begin="7" end="4" resetval="0x0" description="Number of Words to be Transmitted This field defines the number of words which will be transmitted in a DATA_N_WORD frame. This is a user-defined field that must match the corresponding field in the receiver. Set this bitfield to be one less than the number of words to be transmitted.  0h (R/W) = 1 data word frame (16-bit data). 1h (R/W) = 2 data word frame (32-bit data). .. Fh (R/W) = 16 data word frame (256-bit data)." range="7 - 4" rwaccess="RW"/> 
		<bitfield id="FRAME_TYPE" width="4" begin="3" end="0" resetval="0x0" description="Transmit Frame Type This field determines the type of frame that will be transmitted next.  0000b (R/W) = Ping Frame. This frame can be sent either by software or automatically by hardware. 0100b (R/W) = DATA_1_WORD Frame. One word data frame (16-bit data). 0101b (R/W) = DATA_2_WORD Frame. Two word data frame (32-bit data). 0110b (R/W) = DATA_4_WORD Frame. Four word data frame (64-bit data).  0111b (R/W) = DATA_6_WORD Frame. Six word data frame (96-bit data). 0011b (R/W) = DATA_N_WORD Frame. The N_WORDS field will determine the number of words (1 to 16) to be sent. Both the transmitter and receiver must have the same value programmed. 1111b (R/W) = Error Frame. This frame can be used during error conditions or any condition where the transmitter wants to notify the receiver of a high priorty status. However, the user software is at liberty to use this for any purpose.  0001b, 0010b, and 1000b through 1110b are Reserved and should not be used." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_TX2_TX_FRAME_TAG_UDATA" acronym="CONTROLSS_FSI1_TX2_TX_FRAME_TAG_UDATA" offset="0xE" width="16" description="">
		<bitfield id="USER_DATA" width="8" begin="15" end="8" resetval="0x0" description="User Data bits This is a user-defined value that will be loaded into the the user data phase of the frame. This 8-bit value can be used by the receiver for any application need. This value will not impact any hardware behavior." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="FRAME_TAG" width="4" begin="3" end="0" resetval="0x0" description="This will be used only for software initiated transmissions. Frame tag bits This is a user-defined value that will be loaded into the frame tag phase of the next transmission. The receiver may use the frame tag for any application need. This value will not impact any hardware behavior  For external triggers do not use this register. Use the TX_PING_TAG register instead." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_TX2_TX_BUF_PTR_LOAD" acronym="CONTROLSS_FSI1_TX2_TX_BUF_PTR_LOAD" offset="0x10" width="16" description="">
		<bitfield id="BUF_PTR_LOAD" width="4" begin="3" end="0" resetval="0x0" description="Buffer Pointer Load bits These bits are used to force the transmit buffer pointer to a desired index within the transmit buffer. The next transmission will begin picking data from this index and increment appropriately. This value will be reflected in TX_BUF_PTR_STS only after a minimum 3 SYSCLK cycles + 3 TXCLK cycles.  This value should not be written while there is an active transmission as it may corrupt the ongoing frame or other undefined behavior." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_TX2_TX_BUF_PTR_STS" acronym="CONTROLSS_FSI1_TX2_TX_BUF_PTR_STS" offset="0x12" width="16" description="">
		<bitfield id="CURR_WORD_CNT" width="5" begin="12" end="8" resetval="0x0" description="Words Remaining in the transmit buffer  This value indicates the number of words present in the data buffer which have not yet been transmitted. This value is only valid when there is no active transmission.  Note: This value will not be valid if there is a buffer overrun or underrun condition." range="12 - 8" rwaccess="RO"/> 
		<bitfield id="CURR_BUF_PTR" width="4" begin="3" end="0" resetval="0x0" description="Current Buffer Pointer Index This bitfield will show the current index of the buffer pointer. This value is only valid when there is no active transmission." range="3 - 0" rwaccess="RO"/>
	</register>
